{"keras_version": "1.2.2", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "arguments": {}, "output_shape_type": "raw", "trainable": true, "output_shape": null, "function_type": "lambda", "name": "lambda_1", "batch_input_shape": [null, 64, 64, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00a1\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "activity_regularizer": null, "border_mode": "same", "subsample": [2, 2], "name": "convolution2d_1", "init": "glorot_uniform", "activation": "relu", "nb_col": 5, "dim_ordering": "tf", "b_constraint": null, "W_regularizer": null, "trainable": true, "b_regularizer": null, "nb_row": 5, "nb_filter": 24, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "strides": [1, 1], "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "activity_regularizer": null, "border_mode": "same", "subsample": [2, 2], "name": "convolution2d_2", "init": "glorot_uniform", "activation": "relu", "nb_col": 5, "dim_ordering": "tf", "b_constraint": null, "W_regularizer": null, "trainable": true, "b_regularizer": null, "nb_row": 5, "nb_filter": 36, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "same", "strides": [1, 1], "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_2"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "activity_regularizer": null, "border_mode": "same", "subsample": [2, 2], "name": "convolution2d_3", "init": "glorot_uniform", "activation": "relu", "nb_col": 5, "dim_ordering": "tf", "b_constraint": null, "W_regularizer": null, "trainable": true, "b_regularizer": null, "nb_row": 5, "nb_filter": 48, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "same", "strides": [1, 1], "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_3"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "activity_regularizer": null, "border_mode": "same", "subsample": [1, 1], "name": "convolution2d_4", "init": "glorot_uniform", "activation": "relu", "nb_col": 3, "dim_ordering": "tf", "b_constraint": null, "W_regularizer": null, "trainable": true, "b_regularizer": null, "nb_row": 3, "nb_filter": 64, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "same", "strides": [1, 1], "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_4"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "activity_regularizer": null, "border_mode": "same", "subsample": [1, 1], "name": "convolution2d_5", "init": "glorot_uniform", "activation": "relu", "nb_col": 3, "dim_ordering": "tf", "b_constraint": null, "W_regularizer": null, "trainable": true, "b_regularizer": null, "nb_row": 3, "nb_filter": 64, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "same", "strides": [1, 1], "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "input_dim": 4096, "output_dim": 1164, "b_constraint": null, "W_regularizer": null, "trainable": true, "b_regularizer": null, "activation": "relu", "name": "dense_1", "bias": true}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "input_dim": 1164, "output_dim": 100, "b_constraint": null, "W_regularizer": null, "trainable": true, "b_regularizer": null, "activation": "relu", "name": "dense_2", "bias": true}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "input_dim": 100, "output_dim": 50, "b_constraint": null, "W_regularizer": null, "trainable": true, "b_regularizer": null, "activation": "relu", "name": "dense_3", "bias": true}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "input_dim": 50, "output_dim": 10, "b_constraint": null, "W_regularizer": null, "trainable": true, "b_regularizer": null, "activation": "relu", "name": "dense_4", "bias": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "input_dim": 10, "output_dim": 1, "b_constraint": null, "W_regularizer": null, "trainable": true, "b_regularizer": null, "activation": "linear", "name": "dense_5", "bias": true}}]}